In [1]:
import pandas as pd
import numpy as np

In [5]:
#criacao de um dataframe com valor repetido
df = pd.DataFrame({'col1': [1,2,3,4], 'col2': [444,555,666,444], 'col3': ['abc', 'def', 'ghi', 'xyz']})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [6]:
#retorna os valores unicos da coluna selecionada
df['col2'].unique()

array([444, 555, 666])

In [7]:
#tambem possivel atraves de funcao numpy
np.unique(df['col2'])

array([444, 555, 666])

In [9]:
#retorna a quantidade de valores unicos
df['col2'].nunique()

3

In [10]:
#retorna uma contagem com os valores unicos
df['col2'].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [11]:
def dividido4(x):
    return x/4

In [12]:
#eh possivel aplicar uma funcao em uma certa coluna do dataframe atraves do .apply()
df['col1'].apply(dividido4)

0    0.25
1    0.50
2    0.75
3    1.00
Name: col1, dtype: float64

In [13]:
#tambem eh possivel aplicar funcoes lambda
df['col1'].apply(lambda x: x/10)

0    0.1
1    0.2
2    0.3
3    0.4
Name: col1, dtype: float64

In [15]:
#permite organizar os valores do Dataframe
df.sort_values(by='col2', inplace=True)
df

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi